Revit 2027 API
BalusterPlacement.PostPattern Property
 Accesses the object containing properties related to the post pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PostPattern PostPattern { get; }
Public ReadOnly Property PostPattern As PostPattern
	Get
public:
property PostPattern^ PostPattern {
	PostPattern^ get ();
}
member PostPattern : PostPattern with get
Property Value
PostPattern
See Also
Reference
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace